{
    "importModule": {
        "title": "Importer circuitikz",
        "paragraph1": "Première chose à faire, importer le package circuitikz. Pour cela rien de plus simple, vous ajoutez <c>\\usepackage{circuitikz}</c> dans l'entête de votre document LaTeX. Pour être précis, là où il y a toutes les autres lignes commençant par <c>\\usepackage{...}</c>.",
        "paragraph2": "Et voilà, vous êtes prêt·e à utiliser circuitikz. Pour cela, à l'intérieur du document ouvrez une zone de dessin avec <c>\\begin{circuitikz }</c>, et fermez là comme d'habitude avec <c>\\end{circuitikz}</c>. Votre code devrait ressembler à ceci :"
    },
    "bipolePosition": {
        "title": "Dessiner une résistance",
        "paragraph1": "Commençons par quelque chose de simple, dessiner une résistance. Pour cela on commence par écrire <c>\\draw</c>, puis on indique le point de départ <c>(x, y)</c>. On indique ce que l'on veut tracer, <c>to</c> indique qu'il s'agit d'un dipôle, et <c>R</c> une résistance. Il ne reste plus qu'à indiquer le point d'arriver, et surtout mettre <c>;</c> pour dire que l'on a fini de dessiner. Souvent les erreurs de compilation viennent d'un oubli de <c>;</c> en fin de ligne."
    },
    "bipoleNames": {
        "title": "Dessiner d'autres dipôles",
        "paragraph1": "Vous voulez dessiner autre chose ? Tant que c'est un dipôle, on va utiliser <c>to</c>. Il suffit alors de changer le contenu de crochets. Par exemple <c>to[C]</c> vous donner un condensateur, et <c>battery1</c> une pile (comme vous vous en douté il existe aussi <c>battery</c> et <c>battery2</c>). Je vous laisse tester les dipôles présent pour l'instant dans physic-schem."
    },
    "bipoleAnnotations": {
        "title": "Annoter ses composants",
        "paragraph1": "Il est fréquent que l'on veuille donner un petit nom à nos composants, tel que Robert le potentiomètre, ou plus classiquement la résistance R1. On peut aussi indiquer une information sur le composant, comme sa résistivité. Pour cela vous avez le label et l'annotation, qui sont des options à ajouter. Pour le label c'est <c>l=</c> et pour l'annotation c'est <c>a=</c>. Simple non ?",
        "paragraph2": "Attention, physic-schem présente une grande limite comparé à l'utilisation de circuitikz : l'absence d'équation. En effet, je n'ai pas encore implémenté la gestion des équations LaTeX. Alors que si vous utilisez circuitikz, vous pouvez utiliser des équations dans vos labels et annotations. Par exemple une résistance R1 s'écrira <c>to[R, l=$R_1$]</c> pour avoir un R indice 1.",
        "paragraph3": "Attention aussi au sens de vos composants. Si vous regardez l'exemple suivant, vous remarquerez que la résistance à fait un demi tour avec des étapes intermédiaires. Celle de gauche est tracée de droite à gauche alors que celle de droite est tracée de gauche à droite, ce qui inverse le sens des labels et annotations.",
        "paragraph4": "Retenez que l'ordre des coordonnées à un impact sur le sens du dipôle et donc sur le rendu."
    },
    "bipoleDecorations": {
        "title": "Un peu d'esthétisme aux extrémités",
        "paragraph1": "Vous pouvez ajouter facilement des décorateurs aux extrémités de vos bipôles. Vous avez le choix entre <c>*</c>, <c>*</c> et <c>d</c> qui correspondent à un cercle plein, un cercle vide et un carreau (diamond en anglais). Je vous laisse tester si dessous les différentes combinaisons possibles et le code associé."
    },
    "bipoleCurrant": {
        "title": "Ajouter du courant",
        "paragraph1": {
            "1": "Il est assez courant de vouloir dessiner les courant passant à travers un composant. Pour cela rien de plus simple, il suffit d'ajouter <c>i=i1</c>. Vous pouvez modifier le sens de la flèche, sa position et la place du texte avec les caractères <c>^</c> et <c>_</c> pour la place du texte (au dessus en dessous). Les caractères <c>></c> et ",
            "2": " pour le sens de la flèche. Leur ordre indique la place de la flèche. Je vous laisse tester par vous même ca sera plus simple."
        },
        "paragraph2": "Petit point d'attention, si vous inverser l'ordre des coordonnées, c'est comme si vous aviez fait une rotation de 180° à votre composant. Tous sera donc inversé."
    },
    "monopole": {
        "title": "Dessiner un monopôle",
        "paragraph1": "Bon, la vie n'est pas faite que de dipôles. Il y a aussi le monopôles, qui sont souvent des indicateurs de tensions. Cette fois le <c>to</c> est remplacé par un <c>node</c>, et à la fin il nous faut ajouter <c>{}</c>. Entre ces accolades vous pouvez mettre un texte qui correspondra au label. La fonctionnalité n'existe pas encore dans physic-schem, mais l'accolade est obligatoire dans circuitikz. Vous pourrez la remplir à votre guise dans votre éditeur LaTeX préféré."
    },
    "multipoles": {
        "title": "Et des multipôles",
        "paragraph1": "Pour les multipôles même logique. Sauf qu'ils on plusieurs pôle. On va donc pouvoir choisir qu'elle pôle sert de point de référence. Pour cela on ajoute l'option <c>anchor=...</c>, remplacez les ... par le nom du pôle qui vous intéresse. Chaque composants à ses propres pôles, mais rassurez vous ce sont des physiciens qui gèrent le code, les noms devraient vous être familier. Pour le nmos les pôles sont <c>B</c>, <c>C</c>, <c>E</c>. Pour l'amplificateur opérationnel, il y a <c>+</c>, <c>-</c>, <c>out</c> pour les entrées sorties, et <c>up</c>, <c>down</c> pour les points d'alimentation."
    },
    "multipolesPointOfInterest": {
        "title": "Utiliser les points d'intérêt des multipôles",
        "paragraph1": "Maintenant on a un problème. Un fois mon multipôle placé, comment je fais pour brancher mes dipôles dessus ? Les créateurs de circuitikz ont pensé à tout. Commencez par donner un nom à votre multipôle comme ceci : <c>node[... ](nomDuComposant) {}</c>. Dans l'exemple ci dessous, j'ai pris <c>opAmp</c> comme nom (oui, ce n'est pas très original). Vous pouvez maintenant utiliser ses pôles comme coordonnées avec les formule suivante :  <c>(nomDuComposant.nomDuPole)</c>, ce qui donne <c>(opAmp.-)</c> pour obtenir la coordonnée du pole - de mon amplificateur opérationnel. Vous pouvez donc bouger ce multipôle autant que vous voulez, les résistances resteront bien attachées à lui."
    },
    "relative coordinates": {
        "title": "Utiliser des coordonnées relatives",
        "paragraph1": "Vous l'avez sans doute remarqué les résistance sont accrochées d'un côté, mais de l'autre tout est fixe. Pour remédier à cela, on va utiliser des coordonnées relatives. Pour cela un écrit <c>++(dx, dy)</c>, qui indique d'ajouter dx et dy à la précédente coordonnée pour obtenir la nouvelle. Vous pouvez maintenant bouger tout le bloc en modifiant uniquement la position de l'AOP."
    }
}